DataProcessors/Залог_ПоЭкспо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>Залог_ПоЭкспо</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Залог</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПередачи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/Реестр.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>Реестр</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПривязкаСотрудник</xr:Item>
				<xr:Item>AccumulationRegister.БалансДолжников</xr:Item>
				<xr:Item>InformationRegister.НачальныеДанныеДоговора</xr:Item>
				<xr:Item>InformationRegister.ПланированиеКонтактов</xr:Item>
				<xr:Item>InformationRegister.ДатыУчетаДоговоров</xr:Item>
				<xr:Item>InformationRegister.СтатусыДолжников</xr:Item>
				<xr:Item>InformationRegister.ДанныеДоговоров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометитьКакНовые</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Должники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийОсновнойДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПроценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЗадолженность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПросроченныеПроценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПросроченныйОсновнойДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Неустойка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Госпошлина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прочее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРасчетаЗадолженности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейПросрочки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбработанФССП</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатЗапросаВФССП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписанВРегистр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Договоры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Договоры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Должники</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРасчетногоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСсудногоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФинансирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьКредита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЕжемесячногоПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЕжемесячногоПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКредита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКредита</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКредитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЕжемесячногоПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЕжемесячногоПлатежа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозникновенияДолга</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасчетаЗадолженности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПокупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоКредитногоДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкПервоначальныйКредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/Залог_ПоЭкспо/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
	// Вставить содержимое обработчика.
	
	БанкЭкс=Новый Массив(3);
	
	БанкЭкс[0]= Справочники.Банки.НайтиПоНаименованию("ЭКСПО");
	БанкЭкс[1]=Справочники.Банки.НайтиПоНаименованию("ЭКСПО АМБ");
	
	БанкЭкс[2]=Справочники.Банки.НайтиПоНаименованию("ЭКСПОББ");

	СсылкаДопРекв=Справочники.ДополнительныеРеквизиты.НайтиПоНаименованию("VIN");
						  
    СсылкаДопРеквЗалог=Справочники.ДополнительныеРеквизиты.НайтиПоНаименованию("ЗАЛОГ");
						  
		   допреквин="";
    	   допрекзалог="";

	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеестрДолжники.Ссылка КАК Ссылка,
		|	РеестрДолжники.НомерСтроки КАК НомерСтроки,
		|	РеестрДолжники.Должник КАК Должник,
		|	РеестрДолжники.Договор КАК Договор,
		|	РеестрДолжники.ТекущийОсновнойДолг КАК ТекущийОсновнойДолг,
		|	РеестрДолжники.ТекущиеПроценты КАК ТекущиеПроценты,
		|	РеестрДолжники.ВсегоЗадолженность КАК ВсегоЗадолженность,
		|	РеестрДолжники.ПросроченныеПроценты КАК ПросроченныеПроценты,
		|	РеестрДолжники.ПросроченныйОсновнойДолг КАК ПросроченныйОсновнойДолг,
		|	РеестрДолжники.Неустойка КАК Неустойка,
		|	РеестрДолжники.Госпошлина КАК Госпошлина,
		|	РеестрДолжники.Прочее КАК Прочее,
		|	РеестрДолжники.ДатаРасчетаЗадолженности КАК ДатаРасчетаЗадолженности,
		|	РеестрДолжники.ДнейПросрочки КАК ДнейПросрочки,
		|	РеестрДолжники.ОбработанФССП КАК ОбработанФССП,
		|	РеестрДолжники.ЗаписанВРегистр КАК ЗаписанВРегистр,
		|	РеестрДолжники.Ссылка.ДатаПередачи КАК ДатаПередачи
		|ИЗ
		|	Документ.Реестр.Должники КАК РеестрДолжники";
	
	Запрос.УстановитьПараметр("Банк", БанкЭкс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		допрекзалог="";

		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		
						//Запрос = Новый Запрос;
						//Запрос.Текст = 
						//	"ВЫБРАТЬ
						//	|	ДополнительныеДанные.Наименование КАК Наименование,
						//	|	ДополнительныеДанные.Реквизит КАК Реквизит
						//	|ИЗ
						//	|	Справочник.ДополнительныеДанные КАК ДополнительныеДанные
						//	|ГДЕ
						//	|	ДополнительныеДанные.Владелец = &Владелец
						//	|	И ДополнительныеДанные.Реквизит = &Реквизит";
						//
						//Запрос.УстановитьПараметр("Владелец", Выборка.Должник);
						//Запрос.УстановитьПараметр("Реквизит", СсылкаДопРекв);
						//
						//РезультатЗапроса = Запрос.Выполнить();
						//
						//ВыборкаДопРек = РезультатЗапроса.Выбрать();
						//
						//Пока ВыборкаДопРек.Следующий() Цикл
						//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
						//	
						//	  допреквин=допреквин+" "+ВыборкаДопРек.Наименование;
						//	
						//КонецЦикла;
						//
						////}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
						//
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	ДополнительныеДанные.Наименование КАК Наименование,
							|	ДополнительныеДанные.Реквизит КАК Реквизит
							|ИЗ
							|	Справочник.ДополнительныеДанные КАК ДополнительныеДанные
							|ГДЕ
							|	ДополнительныеДанные.Владелец = &Владелец
							|	И ДополнительныеДанные.Реквизит = &Реквизит";
						
						Запрос.УстановитьПараметр("Владелец", Выборка.Должник);
						Запрос.УстановитьПараметр("Реквизит", СсылкаДопРеквЗалог);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДопРек = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДопРек.Следующий() Цикл
							// Вставить обработку выборки ВыборкаДетальныеЗаписи
							
							  допрекзалог=допрекзалог+" "+ВыборкаДопРек.Наименование;
							
						КонецЦикла;

						
						
					догСтрока="";	
				 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
					// Данный фрагмент построен конструктором.
					// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	Договоры.НомерДоговора КАК НомерДоговора
						|ИЗ
						|	Справочник.Договоры КАК Договоры
						|ГДЕ
						|	Договоры.Ссылка = &Ссылка";
					
					Запрос.УстановитьПараметр("Ссылка", Выборка.Договор.Ссылка);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						// Вставить обработку выборки ВыборкаДетальныеЗаписи
						догСтрока=ВыборкаДетальныеЗаписи.НомерДоговора;
					КонецЦикла;
					
					//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

										
	
		
		    Если допрекзалог<>""  Тогда
			         Запись=  Объект.ТЧ.Добавить();
				   
			        Запись.ФИО=Выборка.Должник;
					
					Запись.Залог=допрекзалог;
					
					Запись.Договор=догСтрока;
					
					Запись.ДатаПередачи=Формат(Выборка.ДатаПередачи,"ДФ=dd.MM.yyyy");
					
	
				
			
			КонецЕсли;
		
		
		
		    
			
			
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА



	
	
//	  //   
//						//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
//						// Данный фрагмент построен конструктором.
//						// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
//						//
//						Запрос = Новый Запрос;
//						Запрос.Текст = 
//							"ВЫБРАТЬ
//							|	ДополнительныеДанные.Наименование КАК Наименование,
//							|	ДополнительныеДанные.Реквизит КАК Реквизит
//							|ИЗ
//							|	Справочник.ДополнительныеДанные КАК ДополнительныеДанные
//							|ГДЕ
//							|	ДополнительныеДанные.Владелец = &Владелец
//							|	И ДополнительныеДанные.Реквизит = &Реквизит";
//						
//						Запрос.УстановитьПараметр("Владелец", Выборка.Должники.Должник);
//						Запрос.УстановитьПараметр("Реквизит", СсылкаДопРекв);
//						
//						РезультатЗапроса = Запрос.Выполнить();
//						
//						ВыборкаДопРек = РезультатЗапроса.Выбрать();
//						
//						Пока ВыборкаДопРек.Следующий() Цикл
//							// Вставить обработку выборки ВыборкаДетальныеЗаписи
//							
//							  допреквин=допреквин+" "+ВыборкаДопРек.Наименование;
//							
//						КонецЦикла;
//						
//						//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
//						
//						
//						Запрос = Новый Запрос;
//						Запрос.Текст = 
//							"ВЫБРАТЬ
//							|	ДополнительныеДанные.Наименование КАК Наименование,
//							|	ДополнительныеДанные.Реквизит КАК Реквизит
//							|ИЗ
//							|	Справочник.ДополнительныеДанные КАК ДополнительныеДанные
//							|ГДЕ
//							|	ДополнительныеДанные.Владелец = &Владелец
//							|	И ДополнительныеДанные.Реквизит = &Реквизит";
//						
//						Запрос.УстановитьПараметр("Владелец", Выборка.Должники.Должник);
//						Запрос.УстановитьПараметр("Реквизит", СсылкаДопРеквЗалог);
//						
//						РезультатЗапроса = Запрос.Выполнить();
//						
//						ВыборкаДопРек = РезультатЗапроса.Выбрать();
//						
//						Пока ВыборкаДопРек.Следующий() Цикл
//							// Вставить обработку выборки ВыборкаДетальныеЗаписи
//							
//							  допрекзалог=допрекзалог+" "+ВыборкаДопРек.Наименование;
//							
//						КонецЦикла;

//						
//						
//						
//                   Запись=  Объект.ТЧ.Добавить();
//				   
//				   Запись.ФИО=Выборка.Должник;
//				   
//				   Запись.Залог=допрекзалог;		


////					Запись.VINНОМЕР=допреквин;
////					
////					Запись.Залог=допрекзалог;

		
		

	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
	
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
	// Вставить содержимое обработчика.
	
	ТабДокумент=Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб=Истина;
	ТабДокумент.ТолькоПросмотр=Истина;

	ОтчетОбъект = РеквизитФормыВЗначение("Объект");
	
    Макет =  ОтчетОбъект.ПолучитьМакет("Макет");
	
		Для каждого Стр  Из Объект.ТЧ  Цикл
		
	     	 ОбластьСтрока=Макет.ПолучитьОбласть("Строка");
             ОбластьСтрока.Параметры.ФИО=Стр.ФИО;
			 
			 ОбластьСтрока.Параметры.Договор=Стр.Договор;
			 ОбластьСтрока.Параметры.Залог=Стр.Залог;
			 ОбластьСтрока.Параметры.ДатаПередачи=Стр.ДатаПередачи;
			 
			 
	      	 ТабДокумент.Вывести(ОбластьСтрока);
	
	КонецЦикла;
	
	

	
	
	Возврат  ТабДокумент;
	
КонецФункции
&НаКлиенте
Процедура Печать(Команда)
	
	ТабДокумент= ПечатьНаСервере();
	
    ТабДокумент.Показать("Отчет по ");

	
	
	
КонецПроцедуры
